Table of Contents
 Class BimConnectionsImportEvent
Namespace
IdeaStatiCa.BimApiLink.Plugin
Assembly
IdeaStatiCa.BimApiLink.dll
BIM - connection imported event
public class BimConnectionsImportEvent : IdeaUserEventImplementation, IIdeaUserEvent
Inheritance
object
IdeaUserEventImplementation
BimConnectionsImportEvent
Implements
IIdeaUserEvent
Inherited Members
 IdeaUserEventImplementation.EventCategory
 IdeaUserEventImplementation.EventName
 IdeaUserEventImplementation.EventAction
 IdeaUserEventImplementation.EventLabel
 IdeaUserEventImplementation.EventValue
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 BimConnectionsImportEvent(string, string, string)
public BimConnectionsImportEvent(string bimAppName, string requestType, string contryCode)
Parameters
bimAppName string
requestType string
contryCode string
 Edit this page